score = 0

questions = [
    'Какая версия языка сейчас актуальна?',
    'Какая кодировка используется в строках?',
    'Какой оператор сравнения нужно использовать для работы с None и bool?',
    'Сколько значений есть у bool?',
    'Python - низкоуровневый язык?',
    'Python объектно-ориентированный язык?',
    'Какая типизация реализована в Python?',
    'В каком году появился Python?',
    'На каком языке написан интерпретатор CPython?',
    'Сколько планет в Солнечной системе?'
]

answers = [
    'Python3',
    'UTF-8',
    'is',
    '2',
    'Нет',
    'Да',
    'Динамическая',
    '1991',
    'C',
    '8'
]

for i in range(len(questions)):
    print(questions[i], end='\n')
    user_ans = input()
    if user_ans.lower() == answers[i].lower():
        print('Ответ {0} верен.'.format(user_ans), end='\n')
        score += 1
    else:
        print('Неверный ответ.', end='\n')


print('Ваш общий балл: {0}/10.'.format(score))
